J-f-Jensen/PSOC5/DOTplatformio/packages/framework-arduinopsoc5/cores/CY8CKIT-059-SpeeduinoWBO2/libpsoc5/Pin_MAP.h
/*******************************************************************************
* File Name: Pin_MAP.h  
* Version 2.20
*
* Description:
*  This file contains Pin function prototypes and register defines
*
* Note:
*
********************************************************************************
* Copyright 2008-2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#if !defined(CY_PINS_Pin_MAP_H) /* Pins Pin_MAP_H */
#define CY_PINS_Pin_MAP_H

#include "cytypes.h"
#include "cyfitter.h"
#include "cypins.h"
#include "Pin_MAP_aliases.h"

/* APIs are not generated for P15[7:6] */
#if !(CY_PSOC5A &&\
	 Pin_MAP__PORT == 15 && ((Pin_MAP__MASK & 0xC0) != 0))


/***************************************
*        Function Prototypes             
***************************************/    

/**
* \addtogroup group_general
* @{
*/
void    Pin_MAP_Write(uint8 value);
void    Pin_MAP_SetDriveMode(uint8 mode);
uint8   Pin_MAP_ReadDataReg(void);
uint8   Pin_MAP_Read(void);
void    Pin_MAP_SetInterruptMode(uint16 position, uint16 mode);
uint8   Pin_MAP_ClearInterrupt(void);
/** @} general */

/***************************************
*           API Constants        
***************************************/
/**
* \addtogroup group_constants
* @{
*/
    /** \addtogroup driveMode Drive mode constants
     * \brief Constants to be passed as "mode" parameter in the Pin_MAP_SetDriveMode() function.
     *  @{
     */
        #define Pin_MAP_DM_ALG_HIZ         PIN_DM_ALG_HIZ
        #define Pin_MAP_DM_DIG_HIZ         PIN_DM_DIG_HIZ
        #define Pin_MAP_DM_RES_UP          PIN_DM_RES_UP
        #define Pin_MAP_DM_RES_DWN         PIN_DM_RES_DWN
        #define Pin_MAP_DM_OD_LO           PIN_DM_OD_LO
        #define Pin_MAP_DM_OD_HI           PIN_DM_OD_HI
        #define Pin_MAP_DM_STRONG          PIN_DM_STRONG
        #define Pin_MAP_DM_RES_UPDWN       PIN_DM_RES_UPDWN
    /** @} driveMode */
/** @} group_constants */
    
/* Digital Port Constants */
#define Pin_MAP_MASK               Pin_MAP__MASK
#define Pin_MAP_SHIFT              Pin_MAP__SHIFT
#define Pin_MAP_WIDTH              1u

/* Interrupt constants */
#if defined(Pin_MAP__INTSTAT)
/**
* \addtogroup group_constants
* @{
*/
    /** \addtogroup intrMode Interrupt constants
     * \brief Constants to be passed as "mode" parameter in Pin_MAP_SetInterruptMode() function.
     *  @{
     */
        #define Pin_MAP_INTR_NONE      (uint16)(0x0000u)
        #define Pin_MAP_INTR_RISING    (uint16)(0x0001u)
        #define Pin_MAP_INTR_FALLING   (uint16)(0x0002u)
        #define Pin_MAP_INTR_BOTH      (uint16)(0x0003u) 
    /** @} intrMode */
/** @} group_constants */

    #define Pin_MAP_INTR_MASK      (0x01u) 
#endif /* (Pin_MAP__INTSTAT) */


/***************************************
*             Registers        
***************************************/

/* Main Port Registers */
/* Pin State */
#define Pin_MAP_PS                     (* (reg8 *) Pin_MAP__PS)
/* Data Register */
#define Pin_MAP_DR                     (* (reg8 *) Pin_MAP__DR)
/* Port Number */
#define Pin_MAP_PRT_NUM                (* (reg8 *) Pin_MAP__PRT) 
/* Connect to Analog Globals */                                                  
#define Pin_MAP_AG                     (* (reg8 *) Pin_MAP__AG)                       
/* Analog MUX bux enable */
#define Pin_MAP_AMUX                   (* (reg8 *) Pin_MAP__AMUX) 
/* Bidirectional Enable */                                                        
#define Pin_MAP_BIE                    (* (reg8 *) Pin_MAP__BIE)
/* Bit-mask for Aliased Register Access */
#define Pin_MAP_BIT_MASK               (* (reg8 *) Pin_MAP__BIT_MASK)
/* Bypass Enable */
#define Pin_MAP_BYP                    (* (reg8 *) Pin_MAP__BYP)
/* Port wide control signals */                                                   
#define Pin_MAP_CTL                    (* (reg8 *) Pin_MAP__CTL)
/* Drive Modes */
#define Pin_MAP_DM0                    (* (reg8 *) Pin_MAP__DM0) 
#define Pin_MAP_DM1                    (* (reg8 *) Pin_MAP__DM1)
#define Pin_MAP_DM2                    (* (reg8 *) Pin_MAP__DM2) 
/* Input Buffer Disable Override */
#define Pin_MAP_INP_DIS                (* (reg8 *) Pin_MAP__INP_DIS)
/* LCD Common or Segment Drive */
#define Pin_MAP_LCD_COM_SEG            (* (reg8 *) Pin_MAP__LCD_COM_SEG)
/* Enable Segment LCD */
#define Pin_MAP_LCD_EN                 (* (reg8 *) Pin_MAP__LCD_EN)
/* Slew Rate Control */
#define Pin_MAP_SLW                    (* (reg8 *) Pin_MAP__SLW)

/* DSI Port Registers */
/* Global DSI Select Register */
#define Pin_MAP_PRTDSI__CAPS_SEL       (* (reg8 *) Pin_MAP__PRTDSI__CAPS_SEL) 
/* Double Sync Enable */
#define Pin_MAP_PRTDSI__DBL_SYNC_IN    (* (reg8 *) Pin_MAP__PRTDSI__DBL_SYNC_IN) 
/* Output Enable Select Drive Strength */
#define Pin_MAP_PRTDSI__OE_SEL0        (* (reg8 *) Pin_MAP__PRTDSI__OE_SEL0) 
#define Pin_MAP_PRTDSI__OE_SEL1        (* (reg8 *) Pin_MAP__PRTDSI__OE_SEL1) 
/* Port Pin Output Select Registers */
#define Pin_MAP_PRTDSI__OUT_SEL0       (* (reg8 *) Pin_MAP__PRTDSI__OUT_SEL0) 
#define Pin_MAP_PRTDSI__OUT_SEL1       (* (reg8 *) Pin_MAP__PRTDSI__OUT_SEL1) 
/* Sync Output Enable Registers */
#define Pin_MAP_PRTDSI__SYNC_OUT       (* (reg8 *) Pin_MAP__PRTDSI__SYNC_OUT) 

/* SIO registers */
#if defined(Pin_MAP__SIO_CFG)
    #define Pin_MAP_SIO_HYST_EN        (* (reg8 *) Pin_MAP__SIO_HYST_EN)
    #define Pin_MAP_SIO_REG_HIFREQ     (* (reg8 *) Pin_MAP__SIO_REG_HIFREQ)
    #define Pin_MAP_SIO_CFG            (* (reg8 *) Pin_MAP__SIO_CFG)
    #define Pin_MAP_SIO_DIFF           (* (reg8 *) Pin_MAP__SIO_DIFF)
#endif /* (Pin_MAP__SIO_CFG) */

/* Interrupt Registers */
#if defined(Pin_MAP__INTSTAT)
    #define Pin_MAP_INTSTAT            (* (reg8 *) Pin_MAP__INTSTAT)
    #define Pin_MAP_SNAP               (* (reg8 *) Pin_MAP__SNAP)
    
	#define Pin_MAP_0_INTTYPE_REG 		(* (reg8 *) Pin_MAP__0__INTTYPE)
#endif /* (Pin_MAP__INTSTAT) */

#endif /* CY_PSOC5A... */

#endif /*  CY_PINS_Pin_MAP_H */


/* [] END OF FILE */
